# ETL
* How do we get data into a database?
* There are several different patterns, and at a high level you will hear this refered to as an ETL process: extract, transform, load
* This is often used in data warehousing specifically, and is usually done as a batch process

# ETL Steps
* The first step is extraction, where we pull data out of various databases. This could be csv, json files, or other SQL databases
* The second step is to transform it. Sometimes this is aligning data structures, mapping columns, or reducing the data.
* The third part is to load it, to push it into a new data warehouse (or database) as a solution
* Overall we call the ETL process a "pipeline" (or pipelines)

<img src="https://webassets.mongodb.com/_com_assets/cms/ETL_Visual-sa656kl6df.png" width=60%/>

# ETL Thoughts
* ETL is useful in reducing dependancies in the data created for warehouses and data marts
* ETL process can help with permissions issues and heterogeoneity of data sources, especially in an increasingly json world
* ETL tools are robust and processes are well known
* At the same time, the ETL process overall can be fragile depending upon the developer building it (all it takes is one failed statement to stop a pipeline)
* ETL is slow, and the batch-nature means that the data you are looking at is often not live

In [1]:
# Let's do some toy ETL in python
# first, let's load our datasets
import pandas as pd
df_person=pd.read_csv("person.csv")
df_sales=pd.read_csv("sales.csv")

In [2]:
# Let's assume we are building a datamart for the sales team, and we want to hide PII
# information to protect our customers in case of a data breach
df_person.head()

,first_name,last_name,street_address,city,postcode,id
0,Amanda,Miller,4302 John Skyway Apt. 650,West Victor,55311,4910
1,Monica,Jenkins,2794 Danielle Skyway Suite 323,West Jenniferport,91875,910
2,Keith,Richards,395 Lloyd Route Apt. 439,Port Ashleyville,1667,9970
3,Mark,Cowan,4026 Timothy Court,New Sarah,40411,8764
4,Amber,King,74417 Warren Ways Apt. 647,South Kelly,40440,6046

In [3]:
df_person=df_person[["street_address","city","postcode","id"]]
df_person.head()

                   street_address               city  postcode    id
0       4302 John Skyway Apt. 650        West Victor     55311  4910
1  2794 Danielle Skyway Suite 323  West Jenniferport     91875   910
2        395 Lloyd Route Apt. 439   Port Ashleyville      1667  9970
3              4026 Timothy Court          New Sarah     40411  8764
4      74417 Warren Ways Apt. 647        South Kelly     40440  6046

In [4]:
# Now let's check out sales
df_sales.head()

,credit_card_number,credit_card_provider,id,price,purchase_date,isbn10
0,2286937402408045,Discover,8360,7681,2020-03-02,0-7276-4998-1
1,30009424238819,JCB 15 digit,2416,1820,2020-04-13,0-617-66614-8
2,346863220162402,Diners Club / Carte Blanche,1206,2782,2020-09-02,1-4775-5373-8
3,4591096487982840,Mastercard,7494,844,2020-09-23,0-630-45908-8
4,4373723705109567,Maestro,8450,4740,2020-06-06,1-80546-961-4

In [5]:
# I wonder what that date is
df_sales.dtypes

credit_card_number       int64
credit_card_provider    object
id                       int64
price                    int64
purchase_date           object
isbn10                  object
dtype: object

In [6]:
# Let's fix that date column
df_sales["purchase_date"]=pd.to_datetime(df_sales["purchase_date"])
df_sales.head()

,credit_card_number,credit_card_provider,id,price,purchase_date,isbn10
0,2286937402408045,Discover,8360,7681,2020-03-02,0-7276-4998-1
1,30009424238819,JCB 15 digit,2416,1820,2020-04-13,0-617-66614-8
2,346863220162402,Diners Club / Carte Blanche,1206,2782,2020-09-02,1-4775-5373-8
3,4591096487982840,Mastercard,7494,844,2020-09-23,0-630-45908-8
4,4373723705109567,Maestro,8450,4740,2020-06-06,1-80546-961-4

In [7]:
# Now, let's drop all of the people who aren't in the sales. The sales team
# doesn't need to know about them
print(f"Originally there were {len(df_person)} people")
df_person=df_person[df_person["id"].isin(df_sales["id"])]
print(f"In modified set there are {len(df_person)} people")

Originally there were 1000 people
In modified set there are 800 people

In [8]:
# We can keep modifying the data as needed depending upon the business rules.
# For instance, let's say that credit card number is a sensitive but important
# piece of data. That is, we need to know whether the same credit card has been
# used, but we don't want to put the number in the database. How might we solve this?

* Let's assume that was all the transformation we wanted to do. Now we can push this data into the datamart.
* Most ETL libraries will automatically build the schema for you. This is cool!
* This is often done through object relational mapping (ORM) libraries
* In the python ecosystem this is handled usually by SQLAlchemy
* https://www.sqlalchemy.org/

In [9]:
import sqlalchemy
engine = sqlalchemy.create_engine('postgres://jovyan:si330studentuser@localhost:5432/si330')

In [10]:
# once we have the engine created we can actually leverage pandas to push the dataframes directly
# into tables using the to_sql() functions
df_person.to_sql("person",engine)
df_sales.to_sql("sales",engine)

ValueError: Table 'person' already exists.

In [ ]:
# what went wrong?

In [ ]:
# now we can just check out result. For this in an interactive model I like to use the %sql magics

In [ ]:
%load_ext sql
%sql postgres://jovyan:si330studentuser@localhost:5432/si330

In [ ]:
%sql select * from person limit 5;

In [ ]:
%sql select * from sales limit 5;

In [ ]:
# wait, is this what we want? what's wrong?

In [ ]:
%sql select * from sales limit 5;

* ok, that's the end of the ETL process. In our case it was pretty simple. In this week's assignment you have a bigger job to do
* a large scale business will have hundreds of these kinds of processes fire up nightly (or hourly), there's a lot that can go wrong
* an emerging technology to deal with these issues is called __data virtualization__ 
* I think data virtualization is frankly amazing and a game changer. In the data virtualization approach the data is left at it's source and the transformations are are "soft rules" which are done at run time
* Here is the sort of ETLhell that corporations can be locked into

<img src="https://community.denodo.com/tutorials/img/basics/zero_complete.png" />

* it can be a complete mess! The promise with data virtualization is that instead of these systems all speaking across one another with error prone ETL, you build a logial data layer which hides the implementation details
* everything in that logical layer looks like a new database, regardless of whether it's a csv, google sheet, api, json datastore, on prem or in the cloud
<img src="https://community.denodo.com/tutorials/img/basics/zero_denodo.png" />

* I'm going to try and arrange for a demonstration of a specific tool, Denodo, which we have here on campus.
* It's really really expensive, and reminds me of the "early days" of RDBMS systems with 6 digit price tags
* But it works really well, in my opinion, for some of my workloads
* (images ripped from https://community.denodo.com/tutorials/browse/basics/index)

# Views
* So we've ETLed the data up into our RDBMS for the sales team, but now we need to make views for them to make the data more coherent
* views allow us to create "virtual tables", where the underlying view the result of some query
* this allows to do further transformation and restriction of data if we want to
* it also allows us to bring the data together into something more managable for the person querying it

In [ ]:
%sql select * from person limit 5;

In [ ]:
# the simple view syntax is CREATE VIEW name AS select_statement
%sql create view only_ports as select * from person where city like '%port%';

In [ ]:
# this has allowed us to restrict which ROWS a user sees based on a given condition
%sql select * from only_ports limit 5;

In [ ]:
# we can restrict columns as well, maybe these users aren't allowed to see street_addresses
%sql drop view only_ports;
%sql create view only_ports as select city, postcode, id from person where city like '%port%';
%sql select * from only_ports limit 5;

In [ ]:
%sql select count(*) as num, avg(price) as avg_price, min(purchase_date) as min_date from sales

In [ ]:
# of course, we can set views to be the results of pretty much any SQL query, so they could be summary stats to
%sql create view summary_sales as select count(*) as num, avg(price) as avg_price, min(purchase_date) as min_date from sales
%sql select * from summary_sales

In [ ]:
# what's really cool about views is that they are live views into the underlying tables.
# change a table and the view changes.
%sql insert into sales (price) values (9999);

In [ ]:
%sql select * from summary_sales

In [ ]:
# My person particularities won't let me keep bad data in this database
%sql select * from sales where credit_card_number is null

In [ ]:
%sql delete from sales where credit_card_number is null

In [ ]:
# views are also updatable, sometimes. This is interesting, and sometimes infuriating
%sql select * from only_ports limit 5;

In [ ]:
%sql select count(*) from only_ports

In [ ]:
%sql insert into only_ports (city, postcode, id) values ('Chrisport','90210',22);

In [ ]:
%sql select count(*) from only_ports

In [ ]:
%sql insert into only_ports (city, postcode, id) values ('Beverly Hills','90210',22);

In [ ]:
# did it put it in our view?
%sql select count(*) from only_ports

In [ ]:
# whew, that's good, it's not a port
# but wait, what about our underlying table?
%sql select * from person where city ='Beverly Hills'

In [ ]:
# we can dabble in some advanced parameters after checking the docs to control this behavior
%sql drop view if exists only_ports
%sql create view only_ports as select * from person where city like '%port%' with check option;

In [ ]:
%sql insert into only_ports (city, postcode, id) values ('Beverly Hills','90210',22);

In [ ]:
%sql insert into only_ports (city, postcode, id) values ('Beverly Hillsport','90210',22);

In [ ]:
# ok, whew, that was a lot, let's get rid of our tables now and clean up
%sql drop table person;
%sql drop tables sales;